In [1]:
import pandas as pd

## Q1: Create a Series with indexes = 1, 2, 3 and has three names.

In [2]:
Series1 =  pd.Series(['Ali', 'Mohammed', 'Ahmed'], index=[1, 2, 3])
Series1

1         Ali
2    Mohammed
3       Ahmed
dtype: object

## Q2: Change indexes to 11, 12, 13.

In [5]:
Series1.index = [11,12,13]
Series1

11         Ali
12    Mohammed
13       Ahmed
dtype: object

## Q3: Retrieve First and second elements.

In [6]:
Series1[:2]

11         Ali
12    Mohammed
dtype: object

## Q4: Add duplicate elements, then remove the duplication

In [9]:
Series1 = pd.concat([Series1 , pd.Series(['Mohammed'], [14])])
Series1

11         Ali
12    Mohammed
13       Ahmed
14    Mohammed
14    Mohammed
dtype: object

In [10]:
Series1.drop_duplicates()

11         Ali
12    Mohammed
13       Ahmed
dtype: object

## Q5: Create a Students DataFrame has three columns (ID, Name)

In [12]:
Data = {
    'ID': ['1014'],
    'Name': ['Ali Hussain']
}

StudentDF = pd.DataFrame(Data, columns=['ID', 'Name']) 

StudentDF

     ID         Name
0  1014  Ali Hussain

## Q6: Read educ_figdp_1_Data.csv file

In [13]:
DataFromCSV = pd.read_csv('educ_figdp_1_Data.csv')

DataFromCSV

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e
...,...,...,...,...,...
379,2007,Finland,Total public expenditure on education as % of ...,5.90,NaN
380,2008,Finland,Total public expenditure on education as % of ...,6.10,NaN
381,2009,Finland,Total public expenditure on education as % of ...,6.81,NaN
382,2010,Finland,Total public expenditure on education as % of ...,6.85,NaN
383,2011,Finland,Total public expenditure on education as % of ...,6.76,NaN

## Q7: What is the difference between loc and slicing?
- loc use the index labels as references
- slice use the position as references

In [14]:
# loc with specific columns
DataFromCSV.loc[5:15, ['GEO', 'Value']]

                              GEO Value
5   European Union (28 countries)  4.92
6   European Union (28 countries)  4.91
7   European Union (28 countries)  4.92
8   European Union (28 countries)  5.04
9   European Union (28 countries)  5.38
10  European Union (28 countries)  5.41
11  European Union (28 countries)  5.25
12  European Union (27 countries)  4.91
13  European Union (27 countries)  4.99
14  European Union (27 countries)  5.00
15  European Union (27 countries)  5.04

In [22]:
# loc
DataFromCSV.loc[5:15]

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
5,2005,European Union (28 countries),Total public expenditure on education as % of ...,4.92,e
6,2006,European Union (28 countries),Total public expenditure on education as % of ...,4.91,e
7,2007,European Union (28 countries),Total public expenditure on education as % of ...,4.92,e
8,2008,European Union (28 countries),Total public expenditure on education as % of ...,5.04,e
9,2009,European Union (28 countries),Total public expenditure on education as % of ...,5.38,e
10,2010,European Union (28 countries),Total public expenditure on education as % of ...,5.41,e
11,2011,European Union (28 countries),Total public expenditure on education as % of ...,5.25,e
12,2000,European Union (27 countries),Total public expenditure on education as % of ...,4.91,s
13,2001,European Union (27 countries),Total public expenditure on education as % of ...,4.99,s
14,2002,European Union (27 countries),Total public expenditure on education as % of ...,5.00,e
15,2003,European Union (27 countries),Total public expenditure on education as % of ...,5.04,e

In [23]:
# slicing
DataFromCSV[5:15]

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
5,2005,European Union (28 countries),Total public expenditure on education as % of ...,4.92,e
6,2006,European Union (28 countries),Total public expenditure on education as % of ...,4.91,e
7,2007,European Union (28 countries),Total public expenditure on education as % of ...,4.92,e
8,2008,European Union (28 countries),Total public expenditure on education as % of ...,5.04,e
9,2009,European Union (28 countries),Total public expenditure on education as % of ...,5.38,e
10,2010,European Union (28 countries),Total public expenditure on education as % of ...,5.41,e
11,2011,European Union (28 countries),Total public expenditure on education as % of ...,5.25,e
12,2000,European Union (27 countries),Total public expenditure on education as % of ...,4.91,s
13,2001,European Union (27 countries),Total public expenditure on education as % of ...,4.99,s
14,2002,European Union (27 countries),Total public expenditure on education as % of ...,5.00,e

In [21]:
# Selection
DataFromCSV[['TIME', 'GEO']]

     TIME                            GEO
0    2000  European Union (28 countries)
1    2001  European Union (28 countries)
2    2002  European Union (28 countries)
3    2003  European Union (28 countries)
4    2004  European Union (28 countries)
..    ...                            ...
379  2007                        Finland
380  2008                        Finland
381  2009                        Finland
382  2010                        Finland
383  2011                        Finland

[384 rows x 2 columns]